
//-------------------ספריית express-------------------------- 
const express=require('express'); // חיבור לסיפריית אקספרס
const app=express(); // יצירת האובייקט מסוג הספריה 
//-----------------------------------------------------------

//-----------------ספריית CORS------------------------------
// מאפשרת בקרת גישה לפי מקור שיטות והדרים
const cors = require('cors');
app.use(cors()); // נותן גישה לכולם 
//-----------------------------------------------------------

//----------------ספריית morgan-------תיעוד לכל הבקשות------
const morgan=require('morgan'); //חיבור לסיפריית מורגן
app.use(morgan('dev')); // מתוך מספר ספריות של מורגן אנחנו נבחר ספריית דב
//-----------------------------------------------------------

//-------------- חיבור לתקיית dot.env ------------------
require('dotenv').config(); // דברים שצריך להסתיר נסתיר בקובץ ENV
//-----------------------------------------------------------

//---------- חיבור לבסיס הנתונים שלי--------------------------
require('./DataBase/mongoDB');
//-----------------------------------------------------------

//----------- המרת נתונים גולמיים לג'ייסון או URL ENCODED  ----------
// הוספת שכבה שממירה את הנתונים הגולמיים שמתקבלים לפורמט json
app.use(express.json());
//-----------------------------------------------------------
// הוספת שכבה שממירה את הנתונים הגולמיים שמתקבלים לפורמט urlencoded
app.use(express.urlencoded({
    extended:false
}));
// ישנם מספר פורמטים להמרת נתונים 2 אלו הם הנפוצים ביותר
//-----------------------------------------------------------

//------------  חיבור לכל נקודות הקצה שיש באפליקציה  ---------------
const { routesInit } = require('./api/routes/config-routes'); // גישה לראוטים הראשונים
routesInit(app);
//----------------------------------------------------------------------




//----------------------ייצא----------------------------
module.exports=app; // לייצא החוצה

