// יש לשים לב שהמודל שלנו יהיה באותם השמות כמו בבסיס הנתונים שלנו כולל טיפוס הנתונים של השדות

const mongoose=require('mongoose'); // נייבא את הסיפרייה 

mongoose.pluralize(null); // מבטל את ההתערבות של ספריית מונגוס בשמות הקבצים שלי

// ככה בדיוק נראים השדות בטבלה שמונגו דיבי
const ContactRequestSchema=mongoose.Schema({
    _id:mongoose.Schema.Types.ObjectId,
    ID:Number,          // מספר יחודי לבקשת יצירת קשר, מתקבל אוטומטית מטבלה אחרת שעוקבת אחר טבלה זו
    ClientID:Number,    // מספר הלקוח, במידה ומי שמנסה ליצור קשר הוא גם לקוח שדה זה מקבל את המספר, אוטומטי
    Fname:String,       // שם פרטי
    Lname:String,       // שם משפחה
    Email:String,       // דואר אלקטרוני
    Title:String,       // כותרת הבקשה
    Details:String,     // פירוט הבקשה
    CustemerFlow:[{   
        Date: String,          //  תיעוד התקשרות עם הלקוח בצורת מערך לדוגמא :    ↓
        Time: String,          // 24.01.2023  15:35  נוצר קשר עם הלקוח והוסבר לו     
        Message: String        // 25.01.2023  08:43  הבעיה נפתרה אפשר לסגור את הבקשה
    }],                            
    Status:Boolean,     // האם הבקשה פתוחה או כבר נסגרה, בזמן היצירה נוצר אוטומטית על פתוח
    Important:Boolean,  // האם הבקשה חשובה, נוצר באופן אוטומטי על, לא חשוב, המנהל יכול לשנות בהמשך
    Received:String     // תאריך בו הבקשה נוצרה, נוצר באופן אוטומטי
});

//----------------------ייצא----------------------------
// שם של האוסף ,הטבלה, בבסיס הנתונים והסכימה של המסמכים הכלולים בו 
module.exports=mongoose.model("contactrequest",ContactRequestSchema); // יש לשים לב שהאוסף באותו שם