
// בקובץ זה נגדיר ראוטר ונייצא אותו החוצה
const router=require('express').Router();  // יצירת אובייקט של ראוטר המכיל את ההגדרות של הניתובים

// הפונקציות שלנו שנמצאות בקונטרולר יש לשים לב לשמות הפונקציות 
const {
    GetAllUser,   // פונקציה שמחזירה את כל המשתמשים
    GetUserById,  // פונקציה שמחזירה משתמש לפי האיידי הייחודי שלו
    DeleteUser,   // פונקציה למחיקת משתמש לפי האיידי הייחודי שלו
    UpdateUser,   // פונקציה לעידכון פרטי המשתמש
    VerifyUser    // פונקציה לאימות משתמש שמחזיר את הפרטים שלו
} = require('../controller/admin'); // נתיב בו נמצאות הפונקציות שלי
 
//---------------  ניתובים לניהול משתמשים  ----------------------
//-- יש ליזכור שאם אתה מגיע לפה אתה כבר מקבל '/adminmanagement' ---

// ניתוב המחזיר את כל המשתמשים --- POST
// במידה ובניתוב יש /getalluser
// אני מפעיל את הפונקציה GetAllUser                                                       פעולת POST
router.post('/getalluser',GetAllUser); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/adminmanagement/getalluser
//----------------------------------

// ניתוב המחזיר משתמש לפי האיידי --- GET
// במידה ובניתוב יש /:pid
// אני מפעיל את הפונקציה GetUserById                                                פעולת GET
router.get('/:pid',GetUserById); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/adminmanagement/{id}
//----------------------------------

// ניתוב למחיקה של משתמש לפי האיידי--- DEL
// במידה ובניתוב יש /:pid
// אני מפעיל את הפונקציה DeleteUser                                                   פעולת DELETE
router.delete('/:pid',DeleteUser); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/adminmanagement/{id}
//----------------------------------

// ניתוב לעידכון של משתמש לפי האיידי---- PATCH
// במידה ובניתוב יש /:pid
// אני מפעיל את הפונקציה UpdateUser                                                  פעולת PATCH
router.patch('/:pid',UpdateUser); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/adminmanagement/{id}
//----------------------------------

// ניתוב שמאמת זהות המתחבר ומחזיר את הפרטים שלו -- POST                                  פעולת POST
router.post('/VerifyUser',VerifyUser);  // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/adminmanagement/VerifyUser
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה