
// בקובץ זה נגדיר ראוטר ונייצא אותו החוצה
const router=require('express').Router();  // יצירת אובייקט של ראוטר המכיל את ההגדרות של הניתובים

// הפונקציות שלנו שנמצאות בקונטרולר יש לשים לב לשמות הפונקציות 
const {
    SendContactUs // פונקציית שליחת בקשת ליצור קשר
}=require('../controller/contactus'); // נתיב בו נמצאות הפונקציות שלי

//---------------  ניתוב לשליחת בקשה ליצירת קשר  -------------
//-- יש ליזכור שאם אתה מגיע לפה אתה כבר מקבל '/contactus' ---

//-------- ניתוב לשליחת בקשת צור קשר -------- POST
// במידה ובניתוב יש /send
// אני מפעיל את הפונקציה SendContactUs                                                פעולת POST
router.post('/send',SendContactUs);  // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --> http://localhost:3001/contactus/send
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה