// בקובץ זה נגדיר ראוטר ונייצא אותו החוצה
const router=require('express').Router();  // יצירת אובייקט של ראוטר המכיל את ההגדרות של הניתובים

// הפונקציה שלנו שנמצאת בקונטרולר יש לשים לב לשם הפונקציה
const {
    Pay, // פונקציה להוספת קבלה חדשה
    AddSiteToTrack // פונקציה להוספת אתר לניתור
}=require('../controller/receipt'); // נתיב בו נמצאת הפונקציה 

//---------------  ניתוב לתשלום וקבלת קבלה  ----------------
//-- יש ליזכור שאם אתה מגיע לפה אתה כבר מקבל '/receipt' ---

//-------- ניתוב לתשלום --------- POST
// במידה ובניתוב יש /pay
// אני מפעיל את הפונקציה Pay                                                פעולת POST
router.post('/pay',Pay); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/receipt/pay

//-------- ניתוב להוספת אתר לניתור --------- POST
// במידה ובניתוב יש /addsitetotrack
// אני מפעיל את הפונקציה AddSiteToTrack                                                           פעולת POST
router.post('/addsitetotrack',AddSiteToTrack); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/receipt/addsitetotrack

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה