
// בקובץ זה נגדיר ראוטר ונייצא אותו החוצה
const router=require('express').Router();  // יצירת אובייקט של ראוטר המכיל את ההגדרות של הניתובים

// הפונקציות שלנו שנמצאות בקונטרולר יש לשים לב לשמות הפונקציות 
const {
    Register,  // פונקציה להוספת משתמש חדש
    Login      // פונקציית התחברות 
}=require('../controller/user'); // נתיב בו נמצאות הפונקציות שלי

//---------------  ניתובים להרשמה והתחברות  -------------
//-- יש ליזכור שאם אתה מגיע לפה אתה כבר מקבל '/user' ---

//-------- ניתוב להרשמה --------- POST
// במידה ובניתוב יש /signup
// אני מפעיל את הפונקציה Register                                                   פעולת POST
router.post('/signup',Register); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/user/signup
//----------------------------------

//------- ניתוב להתחברות ------- POST
// במידה ובניתוב יש /login
// אני מפעיל את הפונקציה Login                                                  פעולת POST
router.post('/login',Login); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/user/login
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה