
// בקובץ זה נגדיר ראוטר ונייצא אותו החוצה
const router=require('express').Router();  // יצירת אובייקט של ראוטר המכיל את ההגדרות של הניתובים

// הפונקציות שלנו שנמצאות בקונטרולר יש לשים לב לשמות הפונקציות 
const {
    UpdateUser, // פונקציה לעידכון פרטי המשתמש
    VerifyUser  // פונקציה לאימות משתמש שמחזיר את הפרטים שלו
}=require('../controller/userloged'); // נתיב בו נמצאות הפונקציות שלי

//---------------  ניתובים למשתמשים-----------------------
//-- יש ליזכור שאם אתה מגיע לפה אתה כבר מקבל '/usermanagement' ---

// ניתוב לעידכון של משתמש לפי האיידי---- PATCH
// במידה ובניתוב יש /:pid
// אני מפעיל את הפונקציה --- PATCH                                                   פעולת PATCH
router.patch('/:pid',UpdateUser); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/usermanagement/:id
//----------------------------------

// ניתוב שמאמת זהות המתחבר ומחזיר את הפרטים שלו -- POST                                 פעולת POST 
router.post('/VerifyUser',VerifyUser); // על מנת להפעיל פונקציה זו יש לשלוח בכתובת --->  http://localhost:3001/usermanagement/VerifyUser
//----------------------------------

//----------------------ייצא-----------------------------
module.exports=router; // לייצא החוצה